<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas_chap02_0724.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
df = pd.read_csv('friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
df.head() # 데이터를 앞에서부터 5개까지 불러온다.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [5]:
df.head(2)  # 데이터를 앞에서부터 2개 불러온다.

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [6]:
df.tail()   # 데이터를 뒤에서부터 5개까지 불러온다.

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
df.tail(3)    # 데이터를 뒤에서부터 3개 불러온다.

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [8]:
df = pd.read_csv('friend_list.txt')   # csv가 아닌 txt에서도 작동
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('friend_list_tab.txt')   # ,가 아닌 탭으로 구분된 txt일 때
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [10]:
df = pd.read_csv('friend_list_tab.txt', delimiter='\t')   # 경계구분값(delimiter)를 탭(\t)으로 준다.
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df = pd.read_csv('friend_list_no_head.csv')   # 헤드(열 이름)가 없을 때

In [12]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [13]:
df = pd.read_csv('friend_list_no_head.csv', header=None)  # 헤더가 없다고 header=None으로 알려준다.
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [14]:
df.columns=['name','age','job']   # 열이름을 name, age, job으로 준다.
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name','age','job'])    # 위의 상황을 한 줄로 나타내기
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern